##Модуль 1 Введение в Python
##Часть 1



## Задание 1
## Написать в словесной форме и нарисовать блок-схему
## алгоритма посещения кинотеатра.





## №1 Выбрать фильм:

## Просмотреть расписание кинотеатра.
## Выбрать фильм, который вы хотите посмотреть.

## №2 Проверить наличие билетов:

## Проверить, есть ли билеты на выбранный фильм.
## Если билетов нет, то вернуться к шагу 1.

## №3 Купить билет:

## Купить билет на выбранный фильм.
## Получить билет в виде бумажного или электронного документа.

## №4 Прийти в кинотеатр:

## Прийти в кинотеатр за определенное время до начала фильма.
## Предъявить билет сотруднику кинотеатра.

## №5 Посмотреть фильм:

## Зайти в зал, где показывают фильм.
## Посмотреть фильм.

## №6 Выйти из кинотеатра:

## Выйти из зала после окончания фильма.
## Покинуть кинотеатр.





## Блок-схема алгоритма:





print("+-----------------+")
print("|  Выбрать фильм  |")
print("+-----------------+")
print("        |")
print("        |")
print("        v")
print("+-----------------+")
print("| Проверить наличие|")
print("|       билетов    |")
print("+-----------------+")
print("        |")
print("        |")
print("        v")
print("+-----------------+")
print("|  Купить билет    |")
print("+-----------------+")
print("        |")
print("        |")
print("        v")
print("+-----------------+")
print("|  Прийти в кинотеатр|")
print("+-----------------+")
print("        |")
print("        |")
print("        v")
print("+-----------------+")
print("|  Посмотреть фильм |")
print("+-----------------+")
print("        |")
print("        |")
print("        v")
print("+-----------------+")
print("|  Выйти из кинотеатра|")
print("+-----------------+")