##Модуль 1 Введение в Python
##Часть 1



## Задание 1
## Написать в словесной форме и нарисовать блок-схему
## алгоритма посещения кинотеатра.





## №1 Выбрать фильм:

## Просмотреть расписание кинотеатра.
## Выбрать фильм, который вы хотите посмотреть.

## №2 Проверить наличие билетов:

## Проверить, есть ли билеты на выбранный фильм.
## Если билетов нет, то вернуться к шагу 1.

## №3 Купить билет:

## Купить билет на выбранный фильм.
## Получить билет в виде бумажного или электронного документа.

## №4 Прийти в кинотеатр:

## Прийти в кинотеатр за определенное время до начала фильма.
## Предъявить билет сотруднику кинотеатра.

## №5 Посмотреть фильм:

## Зайти в зал, где показывают фильм.
## Посмотреть фильм.

## №6 Выйти из кинотеатра:

## Выйти из зала после окончания фильма.
## Покинуть кинотеатр.





## Блок-схема алгоритма:





# print("+-----------------+")
# print("|  Выбрать фильм  |")
# print("+-----------------+")
# print("        |")
# print("        |")
# print("        v")
# print("+-----------------+")
# print("| Проверить наличие|")
# print("|       билетов    |")
# print("+-----------------+")
# print("        |")
# print("        |")
# print("        v")
# print("+-----------------+")
# print("|  Купить билет    |")
# print("+-----------------+")
# print("        |")
# print("        |")
# print("        v")
# print("+-----------------+")
# print("|  Прийти в кинотеатр|")
# print("+-----------------+")
# print("        |")
# print("        |")
# print("        v")
# print("+-----------------+")
# print("|  Посмотреть фильм |")
# print("+-----------------+")
# print("        |")
# print("        |")
# print("        v")
# print("+-----------------+")
# print("|  Выйти из кинотеатра|")
# print("+-----------------+")





## Задание 2
## Написать в словесной форме и нарисовать блок-схему
## алгоритма игры в боулинг.

# №1 Инициализация игры:

# Игра начинается с приветственного сообщения и введения в правила боулинга.
# Запрашивается имя игрока, которое сохраняется для дальнейшего использования.
# Игра инициализирует счет до 0.
# Цикл игры

# №2 Игрока просят катить шар (бросать шар по дорожке):

# Количество сбитых кеглей генерируется случайным образом (от 0 до 10).
# Счет обновляется в зависимости от количества сбитых кеглей.
# Если игрок сбивает все 10 кеглей (страйк), игра начисляет бонус и переходит к следующему фрейму.
# Если игрок сбил несколько кеглей, но не все 10, игра позволяет ему сделать повторный бросок, чтобы попытаться сбить оставшиеся кегли.
# Игра повторяет шаги 2-5 до тех пор, пока игрок не сделает два броска или не собьет все 10 кеглей.
# Игра переходит к следующему фрейму и повторяет шаги 1-6, пока не будут завершены все 10 фреймов.

# №3 Окончание игры:

# После завершения всех 10 фреймов игра подсчитывает итоговый счет.
# Игра отображает итоговый счет и поздравляет игрока с окончанием игры.




# print("+---------------+")
# print("|  Game Init   |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Welcome     |")
# print("|  Get Player   |")
# print("|  Initialize  |")
# print("|  Score to 0   |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Game Loop    |")
# print("|  Roll Ball    |")
# print("|  Generate Pins|")
# print("|  Update Score |")
# print("|  Check Strike  |")
# print("|  Check Spare   |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Frame Complete|")
# print("|  Move to Next  |")
# print("|  Frame         |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Game Over    |")
# print("|  Calculate    |")
# print("|  Final Score  |")
# print("|  Display Score|")
# print("+---------------+")






## Задание 3
## Написать в словесной форме и нарисовать блок-схему
## алгоритма езды на велосипеде.


## Подготовка:

## Надеть шлем и перчатки
## Проверить исправность велосипеда (тормоза, цепь, давление в шинах)

## Запуск:
## Сесть на велосипед
## Оттолкнуться от земли и начать крутить педали

## Движение:
## Крутить педали и набирать скорость
## Управлять рулем для поддержания направления
## Использовать тормоза для снижения скорости или остановки

## Остановка:
## Нажать на тормоза для остановки велосипеда
## Снять ногу с педали и поставить ее на землю

## Завершение:
## Снять шлем и перчатки
## Проверить велосипед на наличие повреждений
## Блок-схема:

# print("+---------------+")
# print("|  Game Init   |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Welcome     |")
# print("|  Get Player   |")
# print("|  Initialize  |")
# print("|  Score to 0   |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Game Loop    |")
# print("|  Roll Ball    |")
# print("|  Generate Pins|")
# print("|  Update Score |")
# print("|  Check Strike  |")
# print("|  Check Spare   |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Frame Complete|")
# print("|  Move to Next  |")
# print("|  Frame         |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Game Over    |")
# print("|  Calculate    |")
# print("|  Final Score  |")
# print("|  Display Score|")
# print("+---------------+")





## Задание 4
## Написать в словесной форме и нарисовать блок-схему
## алгоритма покупки игровой приставки.

## Подготовка:
## Определить бюджет для покупки игровой приставки
## Исследовать различные модели и их характеристики

## Выбор приставки:
## Сравнить характеристики различных моделей
## Выбрать приставку, соответствующую бюджету и требованиям

## Проверка наличия:
## Проверить наличие выбранной приставки в магазине
## Если приставка не доступна, рассмотреть альтернативные варианты

## Покупка:
## Оформить покупку приставки
## Оплатить стоимость приставки

## Проверка и тестирование:
## Проверить приставку на наличие дефектов
## Протестировать приставку, чтобы убедиться в ее работоспособности

## Блок-схема:

# print("+---------------+")
# print("|  Подготовка  |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Выбор приставки |")
# print("|  Сравнить      |")
# print("|  характеристики |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Проверка наличия |")
# print("|  Проверить      |")
# print("|  наличие в магазине |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Покупка      |")
# print("|  Оформить покупку |")
# print("|  Оплатить стоимость |")
# print("+---------------+")
# print("           |")
# print("           |")
# print("           v")
# print("+---------------+")
# print("|  Проверка и    |")
# print("|  тестирование  |")
# print("|  Проверить на   |")
# print("|  дефекты и     |")
# print("|  протестировать |")
# print("+---------------+")




##Модуль 1 Введение в Python
##Часть 2


## Задание 1
## Выведите на экран надпись Nothing will work unless
## you do на разных строках. Пример вывода:
## Nothing
## will work
## unless you do.



# print("Nothing")
# print("will work")
# print("unless you do")






## Задание 2
## Выведите на экран надпись " Anyone who stops learning
## is old, whether at twenty or eighty" Henry Ford на разных
## строках. Пример вывода:
## “Anyone who
## stops
## learning is old,
## whether at twenty or eighty”.
## Henry Ford





# print("""
# “Anyone who
#     stops
#         learning is old,
#             whether at twenty or eighty”.
#                                     Henry Ford
# """)






## Задание 3
## Пользователь вводит с клавиатуры два числа. Необ-
## ходимо найти сумму чисел, разницу чисел, произведение
## числе. Результат вычислений вывести на экран.



## Ввод двух чисел с клавиатуры
# num1 = float(input("Введите первое число: "))
# num2 = float(input("Введите второе число: "))

# # Вычисление суммы, разницы и произведения
# sum_num = num1 + num2
# diff_num = num1 - num2
# prod_num = num1 * num2

# # Вывод результатов на экран
# print("Сумма чисел:", sum_num)
# print("Разница чисел:", diff_num)
# print("Произведение чисел:", prod_num)







## Задание 4
## Пользователь вводит с клавиатуры два числа. Первое
## число — это значение, второе число процент, который
## необходимо посчитать. Например, мы ввели с клавиатуры
## 50 и 10 Требуется вывести на экран 10 процентов от 50
## Результат: 5




## Ввод двух чисел с клавиатуры
# value = float(input("Введите значение: "))
# percent = float(input("Введите процент: "))

# # Вычисление процента от значения
# result = (percent / 100) * value

# # Вывод результата на экран
# print("Результат:", result)







## Задание 5
## Напишите программу, вычисляющую площадь пря-
## моугольника. Пользователь с клавиатуры вводит ширину
## и высоту прямоугольника.





# #Ввод ширины и высоты прямоугольника с клавиатуры
# width = float(input("Введите ширину прямоугольника: "))
# height = float(input("Введите высоту прямоугольника: "))

# # Вычисление площади прямоугольника
# area = width * height

# # Вывод результата на экран
# print("Площадь прямоугольника:", area)






##Модуль 1 Введение в Python
##Часть 3




## Задание 1
## Пользователь с клавиатуры вводит двухзначное чис-
## ло. Например, 26 Нужно показать на разных строках
## значение первого и второго разряда. В нашем случае это
## будет выглядеть так:
## 2
## 6



# # Ввод двухзначного числа с клавиатуры
# number = int(input("Введите двухзначное число: "))

# # Вычисление значения первого и второго разряда
# first_digit = number // 10
# second_digit = number % 10

# # Вывод результатов на экран
# print("Первый разряд:", first_digit)
# print("Второй разряд:", second_digit)




## Задание 2
## Пользователь с клавиатуры вводит трёхзначное число.
## Например, 891 Нужно показать на разных строках зна-
## чение первого, второго и третьего разряда. Также нужно
## показать на отдельной строке сумму этих трёх чисел.
## В нашем случае это будет выглядеть так:
## 8
## 9
## 1
## 18




# # Ввод трёхзначного числа с клавиатуры
# number = int(input("Введите трёхзначное число: "))

# # Вычисление значения первого, второго и третьего разряда
# first_digit = number // 100
# second_digit = (number // 10) % 10
# third_digit = number % 10

# # Вычисление суммы трёх разрядов
# sum_digits = first_digit + second_digit + third_digit

# # Вывод результатов на экран
# print(first_digit)
# print(second_digit)
# print(third_digit)
# print(sum_digits)





## Задание 3
## Пользователь вводит с клавиатуры две цифры. Необ-
## ходимо создать число, содержащее эти цифры. Например,
## если с клавиатуры введено 9, 7, тогда нужно сформиро-
## вать число 97


# # Ввод двух цифр с клавиатуры
# digit1 = int(input("Введите первую цифру: "))
# digit2 = int(input("Введите вторую цифру: "))

# # Создание числа, содержащего эти цифры
# number = digit1 * 10 + digit2

# # Вывод результата на экран
# print("Сформированное число:", number)






## Задание 4
## Пользователь вводит с клавиатуры температуру по
## шкале Цельсия. Требуется перевести температуру в гра-
## дусы по Фаренгейту и вывести на экран.




# # Ввод температуры по шкале Цельсия с клавиатуры
# celsius = float(input("Введите температуру по шкале Цельсия: "))

# # Перевод температуры в градусы по Фаренгейту
# fahrenheit = (celsius * 9/5) + 32

# # Вывод результата на экран
# print("Температура по шкале Фаренгейта:", fahrenheit)






##Модуль 2 Опраторы ветвлений
##Часть 1





## Задание 1
## Пользователь вводит с клавиатуры число. Необходи-
## мо проверить его на четность и нечетность. Если число
## четное требуется вывести на экран число и надпись Even
## number. Если число нечетное выведите на экран число и
## надпись Odd number.



# # Ввод числа с клавиатуры
# number = int(input("Введите число: "))

# # Проверка числа на четность и нечетность
# if number % 2 == 0:
#     print(number, "Even number")
# else:
#     print(number, "Odd number")






## Задание 2
## Пользователь вводит с клавиатуры число. Необхо-
## димо проверить его на кратность 7 Если число кратно
## требуется вывести на экран число и надпись Number is
## multiple 7 Если число не кратно выведите на экран число
## и надпись Number is not multiple 7






# # Ввод числа с клавиатуры
# number = int(input("Введите число: "))

# # Проверка числа на кратность 7
# if number % 7 == 0:
#     print(number, "Number is multiple 7")
# else:
#     print(number, "Number is not multiple 7")






## Задание 3
## Пользователь вводит с клавиатуры два числа. Необ-
## ходимо найти максимум из двух чисел и показать его на
## экран.




# # Ввод двух чисел с клавиатуры
# number1 = int(input("Введите первое число: "))
# number2 = int(input("Введите второе число: "))

# # Поиск максимума из двух чисел
# if number1 > number2:
#     print("Максимум:", number1)
# else:
#     print("Максимум:", number2)





## Задание 4
## Пользователь вводит с клавиатуры два числа. Необ-
## ходимо найти минимум из двух чисел и показать его на
## экран.





# # Ввод двух чисел с клавиатуры
# number1 = int(input("Введите первое число: "))
# number2 = int(input("Введите второе число: "))

# # Поиск минимума из двух чисел
# if number1 < number2:
#     print("Минимум:", number1)
# else:
#     print("Минимум:", number2)





## Задание 5
## Пользователь вводит с клавиатуры два числа. В зави-
## симости от выбора пользователя нужно показать сумму
## двух чисел, разницу двух чисел, среднеарифметическое
## или произведение двух чисел.





# # Ввод двух чисел с клавиатуры
# number1 = int(input("Введите первое число: "))
# number2 = int(input("Введите второе число: "))

# # Вывод меню выбора операции
# print("Выберите операцию:")
# print("1. Сумма")
# print("2. Разница")
# print("3. Среднеарифметическое")
# print("4. Произведение")

# # Ввод выбора пользователя
# choice = int(input("Введите номер операции: "))

# # Выполнение выбранной операции
# if choice == 1:
#     print("Сумма:", number1 + number2)
# elif choice == 2:
#     print("Разница:", number1 - number2)
# elif choice == 3:
#     print("Среднеарифметическое:", (number1 + number2) / 2)
# elif choice == 4:
#     print("Произведение:", number1 * number2)
# else:
#     print("Недопустимый выбор")





##Модуль 2 Опраторы ветвлений
##Часть 2





## Задание 1
## Пользователь вводит с клавиатуры время в секун-
## дах, прошедшее с начала дня. В зависимости от выбора
## пользователя посчитать, сколько часов, минут и секунд
## осталось до полуночи.





# # Ввод времени в секундах с клавиатуры
# time_in_seconds = int(input("Введите время в секундах, прошедшее с начала дня: "))

# # Вывод меню выбора операции
# print("Выберите, что посчитать:")
# print("1. Часы до полуночи")
# print("2. Минуты до полуночи")
# print("3. Секунды до полуночи")

# # Ввод выбора пользователя
# choice = int(input("Введите номер операции: "))

# # Вычисление времени до полуночи
# total_seconds_in_day = 24 * 60 * 60
# seconds_until_midnight = total_seconds_in_day - time_in_seconds

# # Выполнение выбранной операции
# if choice == 1:
#     hours_until_midnight = seconds_until_midnight // 3600
#     print("Часов до полуночи:", hours_until_midnight)
# elif choice == 2:
#     minutes_until_midnight = seconds_until_midnight // 60
#     print("Минут до полуночи:", minutes_until_midnight)
# elif choice == 3:
#     print("Секунд до полуночи:", seconds_until_midnight)
# else:
#     print("Недопустимый выбор")








## Задание 2
## Пользователь вводит с клавиатуры диаметр окруж-
## ности. В зависимости от выбора пользователя посчитать
## площадь или периметр окружности.






# # Ввод диаметра окружности с клавиатуры
# diameter = float(input("Введите диаметр окружности: "))

# # Вывод меню выбора операции
# print("Выберите, что посчитать:")
# print("1. Площадь окружности")
# print("2. Периметр окружности")

# # Ввод выбора пользователя
# choice = int(input("Введите номер операции: "))

# # Вычисление радиуса окружности
# radius = diameter / 2

# # Выполнение выбранной операции
# if choice == 1:
#     # Вычисление площади окружности
#     area = 3.14159 * (radius ** 2)
#     print("Площадь окружности:", area)
# elif choice == 2:
#     # Вычисление периметра окружности
#     perimeter = 2 * 3.14159 * radius
#     print("Периметр окружности:", perimeter)
# else:
#     print("Недопустимый выбор")






## Задание 3
## Пользователь вводит с клавиатуры стоимость одной
## игровой приставки, их количество и процент скидки.
## В зависимости от выбора пользователя посчитать
## сумму заказа или стоимость одной приставки с учетом
## скидки.




# # Ввод стоимости одной игровой приставки с клавиатуры
# price = float(input("Введите стоимость одной игровой приставки: "))

# # Ввод количества приставок с клавиатуры
# quantity = int(input("Введите количество приставок: "))

# # Ввод процента скидки с клавиатуры
# discount = float(input("Введите процент скидки: "))

# # Вывод меню выбора операции
# print("Выберите, что посчитать:")
# print("1. Сумму заказа")
# print("2. Стоимость одной приставки с учетом скидки")

# # Ввод выбора пользователя
# choice = int(input("Введите номер операции: "))

# # Вычисление суммы заказа или стоимости одной приставки с учетом скидки
# if choice == 1:
#     # Вычисление суммы заказа
#     total_price = price * quantity * (1 - discount / 100)
#     print("Сумма заказа:", total_price)
# elif choice == 2:
#     # Вычисление стоимости одной приставки с учетом скидки
#     discounted_price = price * (1 - discount / 100)
#     print("Стоимость одной приставки с учетом скидки:", discounted_price)
# else:
#     print("Недопустимый выбор")



## Задание 4
## Пользователь вводит с клавиатуры размер файла
## в байтах и количество файлов. В зависимости от выбора пользователя посчитать
## кунду. В зависимости от выбора пользователя посчитать,
## за сколько часов или минут, или секунд скачается файл.



# # Ввод размера файла в байтах с клавиатуры
# file_size = int(input("Введите размер файла в байтах: "))

# # Ввод количества файлов с клавиатуры
# num_files = int(input("Введите количество файлов: "))

# # Ввод скорости скачивания в байтах в секунду с клавиатуры
# download_speed = int(input("Введите скорость скачивания в байтах в секунду: "))

# # Вывод меню выбора операции
# print("Выберите, что посчитать:")
# print("1. За сколько часов скачается файл")
# print("2. За сколько минут скачается файл")
# print("3. За сколько секунд скачается файл")

# # Ввод выбора пользователя
# choice = int(input("Введите номер операции: "))

# # Вычисление общего размера файлов
# total_size = file_size * num_files

# # Вычисление времени скачивания в секундах
# download_time = total_size / download_speed

# # Выполнение выбранной операции
# if choice == 1:
#     # Вычисление времени скачивания в часах
#     hours = download_time / 3600
#     print("Файл скачается за {:.2f} часов".format(hours))
# elif choice == 2:
#     # Вычисление времени скачивания в минутах
#     minutes = download_time / 60
#     print("Файл скачается за {:.2f} минут".format(minutes))
# elif choice == 3:
#     # Вычисление времени скачивания в секундах
#     print("Файл скачается за {:.2f} секунд".format(download_time))
# else:
#     print("Недопустимый выбор")






## Задание 5
## Пользователь с клавиатуры вводит количество часов.
## Если полученное значение находится в диапазоне от 0 до
## 6 нужно вывести надпись Good Night, если в диапазоне от
## 6 до 13 Good Morning, если в диапазоне от 13 до 17 Good
## Day, если в диапазоне от 17 до 0 Good Evening. Верхняя
## граница диапазона не включается. Например, число 6
## относится к 6 до 13





# # Ввод количества часов с клавиатуры
# hours = int(input("Введите количество часов: "))

# # Определение соответствующей надписи
# if 0 <= hours < 6:
#     print("Good Night")
# elif 6 <= hours < 13:
#     print("Good Morning")
# elif 13 <= hours < 17:
#     print("Good Day")
# elif 17 <= hours < 24:
#     print("Good Evening")
# else:
#     print("Недопустимый ввод")






##Модуль 2 Опраторы ветвлений
##Часть 3



## Задание 1
## Пользователь вводит с клавиатуры целое шестизнач-
## ное число. Написать программу, которая определяет,
## является ли введенное число — счастливым (Счастли-
## вым считается шестизначное число, у которого сумма
## первых 3 цифр равна сумме вторых трех цифр).
## 3+2+1.
## С другой стороны 378423 несчастливое число, так
## как 3+7+8 != 4+2+3.
## Если пользователь ввел не шестизначное число тре-
## буется вывести сообщение об ошибке.





# # Ввод шестизначного числа с клавиатуры
# num = input("Введите шестизначное число: ")

# # Проверка, является ли введенное число шестизначным
# if len(num) != 6 or not num.isdigit():
#     print("Ошибка: введенное число не является шестизначным")
# else:
#     # Разбиение числа на две части
#     first_half = num[:3]
#     second_half = num[3:]

#     # Вычисление сумм цифр в каждой части
#     sum_first_half = sum(int(digit) for digit in first_half)
#     sum_second_half = sum(int(digit) for digit in second_half)

#     # Проверка, является ли число счастливым
#     if sum_first_half == sum_second_half:
#         print("Введенное число является счастливым")
#     else:
#         print("Введенное число не является счастливым")




## Задание 2
## Пользователь вводит шестизначное число. Необходимо
## вторую и пятую цифры.
## Например, 723895 должно превратиться в 593827
## Если пользователь ввел не шестизначное число тре-
## буется вывести сообщение об ошибке.






# # Ввод шестизначное число с клавиатуры
# num = int(input("Введите шестизначное число: "))

# # Определение соответствующих надписей
# if 0 <= num < 6:
#     print("Good Night')
# elif 6<=num< 13:
#     print("Good Morning')
# elif 13<=num< 17:
#     print("Good Day")
# elif 17<=num< 24:
#     print("Good Evening")
# else:
#     print("Ошибка: введенное число не является счастливым")






## Задание 3
## Пользователь вводит число. Необходимо вывести на экран все делители числа,
## до 12). В зависимости от полученного номера месяца про-
## грамма выводит на экран надпись: Winter (если введено
## значение 1,2 или 12), Spring (если введено значение от 3
## до 5), Summer (если введено значение от 6 до 8), Autumn
## (если введено значение от 9 до 11).
## Если пользователь ввел значение не в диапазоне от 1
## до 12 требуется вывести сообщение об ошибке.







# # Ввод числа с клавиатуры
# num = int(input("Введите число месяца (1-12): "))

# # Проверка, является ли введенное число в диапазоне от 1 до 12
# if 1 <= num <= 12:
#     # Вывод надписи в зависимости от месяца
#     if num in [1, 2, 12]:
#         print("Winter")
#     elif 3 <= num <= 5:
#         print("Spring")
#     elif 6 <= num <= 8:
#         print("Summer")
#     elif 9 <= num <= 11:
#         print("Autumn")
# else:
#     print("Ошибка: введенное число не в диапазоне от 1 до 12")






## Модуль 3 Циклы.
## Часть 1







# Задание 1
# Пользователь вводит с клавиатуры два числа. Нужно
# показать все числа в указанном диапазоне.
# Задание 2





# # Input two numbers from the user
# num1 = int(input("Введите первое число: "))
# num2 = int(input("Введите второе число: "))

# # Check if num1 is less than or equal to num2
# if num1 <= num2:
#     # Print all numbers in the range from num1 to num2
#     for i in range(num1, num2 + 1):
#         print(i)
# else:
#     print("Ошибка: первое число должно быть меньше или равно второму числу")






## Задание 2
## Пользователь вводит с клавиатуры два числа. Нужно
## показать все нечетные числа в указанном диапазоне.



# # Input two numbers from the user
# num1 = int(input("Введите первое число: "))
# num2 = int(input("Введите второе число: "))

# # Check if num1 is less than or equal to num2
# if num1 <= num2:
#     # Print all odd numbers in the range from num1 to num2
#     for i in range(num1, num2 + 1):
#         if i % 2 != 0:
#             print(i)
# else:
#     print("Ошибка: первое число должно быть меньше или равно второму числу")






## Задание 3
## Пользователь вводит с клавиатуры два числа. Нужно
## показать все четные числа в указанном диапазоне.




# # Input two numbers from the user
# num1 = int(input("Введите первое число: "))
# num2 = int(input("Введите второе число: "))

# # Check if num1 is less than or equal to num2
# if num1 <= num2:
#     # Print all even numbers in the range from num1 to num2
#     for i in range(num1, num2 + 1):
#         if i % 2 == 0:
#             print(i)
# else:
#     print("Ошибка: первое число должно быть меньше или равно второму числу")





## Задание 4
## Пользователь вводит с клавиатуры два числа. Нуж-
## но показать все числа в указанном диапазоне в порядке
## убывания.



# # Input two numbers from the user
# num1 = int(input("Введите первое число: "))
# num2 = int(input("Введите второе число: "))

# # Check if num1 is less than or equal to num2
# if num1 <= num2:
#     # Print all numbers in the range from num1 to num2 in descending order
#     for i in range(num2, num1 - 1, -1):
#         print(i)
# else:
#     print("Ошибка: первое число должно быть меньше или равно второму числу")






## Задание 5
## Пользователь вводит с клавиатуры два числа. Нуж-
## но показать все нечетные числа в указанном диапазоне.
## Если границы диапазона указаны неправильно требуется
## произвести нормализацию границ. Например, пользова-
## тель ввел 33 и 13, требуется нормализация после которой
## начало диапазона станет равно 13, а конец 33




# # Input two numbers from the user
# num1 = int(input("Введите первое число: "))
# num2 = int(input("Введите второе число: "))

# # Normalize the range boundaries
# if num1 > num2:
#     num1, num2 = num2, num1

# # Print all odd numbers in the range from num1 to num2
# for i in range(num1, num2 + 1):
#     if i % 2 != 0:
#         print(i)





## Модуль 3 Циклы. Часть 2





## Задание 1
## Пользователь вводит с клавиатуры два числа. Нужно
## посчитать сумму чисел в указанном диапазоне, а также
## среднеарифметическое.




# # Input two numbers from the user
# num1 = int(input("Введите первое число: "))
# num2 = int(input("Введите второе число: "))

# # Normalize the range boundaries
# if num1 > num2:
#     num1, num2 = num2, num1

# # Calculate the sum of numbers in the range
# total_sum = sum(range(num1, num2 + 1))

# # Calculate the average
# average = total_sum / (num2 - num1 + 1)

# # Print the results
# print("Сумма чисел в диапазоне:", total_sum)
# print("Среднеарифметическое:", average)







## Задание 2
## Пользователь вводит с клавиатуры число. Требуется
## посчитать факториал числа. Например, если введено 3,
## факториал числа 1*2*3 = 6
## Формула для расчета факториала: n! = 1*2*3…*n, где
## n — число для расчета факториала.



# # Input a number from the user
# num = int(input("Введите число: "))

# # Calculate the factorial using a loop
# factorial = 1
# for i in range(1, num + 1):
#     factorial *= i

# # Print the result
# print("Факториал числа:", factorial)




# import math

# # Input a number from the user
# num = int(input("Введите число: "))

# # Calculate the factorial using the math.factorial function
# factorial = math.factorial(num)

# # Print the result
# print("Факториал числа:", factorial)





## Задание 3
## Пользователь вводит с клавиатуры длину линии.
## Нужно отобразить на экране горизонтальную линию
## из *, указанной длины.
## Например, если было введено 7, тогда вывод на экран
## будет такой: *******.




# # Input the length of the line from the user
# line_length = int(input("Введите длину линии: "))

# # Print the horizontal line using *
# print("*" * line_length)





## Задание 4
## Пользователь вводит с клавиатуры длину линии и
## символ для заполнения линии. Нужно отобразить на
## экране горизонтальную линию из введенного символа,
## указанной длины.
## Например, если было введено 5 и &, тогда вывод на
## экран будет такой: &&&&&.




# # Input the length of the line and the fill character from the user
# line_length = int(input("Введите длину линии: "))
# fill_char = input("Введите символ для заполнения линии: ")

# # Print the horizontal line using the fill character
# print(fill_char * line_length)